run/minimalCurvatureFlow/ellipsoidToSphere/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1;
    rho             1;
}

air
{
    transportModel  Newtonian;
    nu              1;
    rho             1;
}

sigma           0.07;

surfaceForces
{
    sigma           0.07;
    surfaceTensionForceModel RDF;
    accelerationForceModel  gravity;
    deltaFunctionModel      alphaCSF;
}
// ************************************************************************* //
